# config utf-8

def listdraw(grid):
    w = grid[0]
    # 横向きに走査
    for i, x in enumerate(w):
        # 縦向きに走査
        for j, y in enumerate(grid):
            print(grid[j][i], end='') # 縦横入れ替え？
        print()

def main():
    grid = [['.', '.', '.', '.', '.', '.'],
            ['.', '0', '0', '.', '.', '.'],
            ['0', '0', '0', '0', '.', '.'],
            ['0', '0', '0', '0', '0', '.'],
            ['.', '0', '0', '0', '0', '0'],
            ['0', '0', '0', '0', '0', '.'],
            ['0', '0', '0', '0', '.', '.'],
            ['.', '0', '0', '.', '.', '.'],
            ['.', '.', '.', '.', '.', '.']]
    listdraw(grid)
    return

if __name__ == '__main__':
    main()